[
  {
    "id": "p001",
    "title": "Classic Cotton T-Shirt",
    "price": 14.99,
    "description": "Experience all-day comfort with our Classic Cotton T-Shirt, crafted from premium breathable cotton. Designed with a relaxed fit, this versatile piece is perfect for layering or wearing solo in any casual setting. Available in multiple colors to suit every style.",
    "category": "Men",
    "image": "https://i.ibb.co/j9kKTRjr/classic-t-shirt-men.jpg"
  },
  {
    "id": "p002",
    "title": "Slim Fit Jeans",
    "price": 39.99,
    "description": "These Slim Fit Jeans are made with high-quality stretch denim for added flexibility and comfort. The modern tapered cut offers a stylish look, while five functional pockets make them practical for daily wear. Dress them up or down for any occasion.",
    "category": "Men",
    "image": "https://i.ibb.co/LXcpCFSF/Slim-Fit-Jeans1.webp"
  },
  {
    "id": "p003",
    "title": "Floral Print Summer Dress",
    "price": 29.99,
    "description": "Step into summer with our Floral Print Summer Dress, featuring a vibrant flower pattern on soft, lightweight fabric. The sleeveless design, flowy skirt, and fitted waist create a flattering silhouette perfect for brunch dates, picnics, or beach outings.",
    "category": "Women",
    "image": "https://i.ibb.co/YT0ZbDft/Floral-Print-Summer-Dress.jpg"
  },
  {
    "id": "p004",
    "title": "Men's Hooded Sweatshirt",
    "price": 34.50,
    "description": "Stay cozy and stylish with our Men's Hooded Sweatshirt. Made from a thick cotton blend, it offers warmth without bulk. The kangaroo pocket and adjustable drawstring hood add function and flair, making it perfect for both lounging and streetwear looks.",
    "category": "Men",
    "image": "https://i.ibb.co/KpsM1vXB/Men-s-Hooded-Sweatshirt.jpg"
  },
  {
    "id": "p005",
    "title": "High-Waist Leggings",
    "price": 22.00,
    "description": "Designed for comfort and performance, our High-Waist Leggings offer a secure fit and sleek look. Made with moisture-wicking stretch fabric, they're ideal for yoga, workouts, or casual days out. The wide waistband provides tummy control and extra support.",
    "category": "Women",
    "image": "https://i.ibb.co/NnVCBgdT/High-Waist-Leggings.webp"
  },
  {
    "id": "p006",
    "title": "Unisex Bomber Jacket",
    "price": 49.99,
    "description": "This Unisex Bomber Jacket brings a modern edge to a classic design. Featuring a zip-up front, ribbed cuffs, and lightweight lining, it's perfect for layering across seasons. Stylish enough for a night out yet casual enough for everyday wear.",
    "category": "Unisex",
    "image": "https://i.ibb.co/WNcXRvz5/Unisex-Bomber-Jacket.jpg"
  },
  {
    "id": "p007",
    "title": "Kid's Cartoon Printed T-Shirt",
    "price": 12.99,
    "description": "Brighten up your child’s day with our Kid's Cartoon Printed T-Shirt. Made from 100% soft cotton, it features colorful and fun character designs your kids will love. The durable stitching and breathable fabric make it ideal for all-day play.",
    "category": "Kids",
    "image": "https://i.ibb.co/dwZXfzRH/Kid-s-Cartoon-Printed-T-Shirt.webp"
  },
  {
    "id": "p008",
    "title": "Women's Denim Skirt",
    "price": 27.95,
    "description": "Our Women's Denim Skirt is a timeless wardrobe essential, combining comfort with style. Designed with a high-rise waist and button-front closure, this skirt pairs effortlessly with tops, tees, or jackets for an instantly chic look.",
    "category": "Women",
    "image": "https://i.ibb.co/tpxfV5Tr/Women-s-Denim-Skirt.jpg"
  },
  {
    "id": "p009",
    "title": "Men's Formal Shirt",
    "price": 31.25,
    "description": "Look sharp in our Men's Formal Shirt, tailored for a clean, structured fit. Crafted from premium cotton blend fabric, it’s breathable yet crisp, ideal for long office hours or formal events. Available in classic colors for maximum versatility.",
    "category": "Men",
    "image": "https://i.ibb.co/hRtR36Tj/Men-s-Formal-Shirt.webp"
  },
  {
    "id": "p010",
    "title": "Kid's Pajama Set",
    "price": 18.75,
    "description": "Ensure a cozy night’s sleep with our Kid’s Pajama Set. Featuring adorable prints and ultra-soft cotton fabric, these pajamas are gentle on sensitive skin. The set includes a short-sleeve top and matching elastic waistband pants for easy wear.",
    "category": "Kids",
    "image": "https://i.ibb.co/ym4MJVqj/Kid-s-Pajama-Set.webp"
  }
]
